cases/RKF45GDHFoam/pitzDaily/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//   default banana;
    default steadyState;
//    default backward;
//    default boundedBackward 0 1;
//default CrankNicholson 1;//0.5;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    //div(phi,C)      Gauss upwind;
    div(phi,C)      Gauss linearUpwind Gauss linear;
 //   div(phi,C)      Gauss Gamma01 0.01;
//    div(phi,C)      Gauss MUSCL01;
}

laplacianSchemes
{
    default         none;
  //  laplacian(D,C) Gauss linear limited 1.0;
//    laplacian(Dturbulent,C) Gauss linear limited 1.0;
    laplacian(D,C) Gauss linear limited 1.0;
    laplacian(Dt,C) Gauss linear limited 1.0;
    laplacian((D+Dt),C) Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    T;
}

// ************************************************************************* //
